<?php

/*
При выполнении задания рекомендуется использовать систему контроля версий Git и готовое задание прислать ссылкой на репозиторий.


Задача
    Реализовать, используя php, объектно-ориентированную систему: прототип сбора продукции. 
    Система должна уметь:      
        Собирать продукцию у всех животных, зарегистрированных в хлеву;
        Подсчитывать общее кол-во собранной продукции.

Реализация графического интерфейса не требуется.  
    Способ инициализации списка животных - на ваше усмотрение.

Результат запуска скрипта
    При запуске скрипта main.php в консоли:
    Система должна добавить животных в хлев;
    Произвести сбор продукции (подоить коров и собрать яйца у кур);
    Вывести на экран общее кол-во собранных шт. яиц и литров молока.

*/